taskt/Core/Automation/Commands/ListGroup/AListCreateFromListCommands_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.AListCreateFromListCommands" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.GetListWithDuplicateItemsRemoved" [ label="GetListWithDuplicateItemsRemoved", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.AListCreateFromListCommands" [ label="AListCreateFromListCommands", style="dashed", ];
"taskt.Core.Automation.Commands.SliceListCommand" [ label="SliceListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.FilterListCommand" [ label="FilterListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SortListCommand" [ label="SortListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ReverseListCommand" [ label="ReverseListCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CopyListCommand" [ label="CopyListCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.GetListWithDuplicateItemsRemoved" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
"taskt.Core.Automation.Commands.SliceListCommand" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
"taskt.Core.Automation.Commands.FilterListCommand" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
"taskt.Core.Automation.Commands.SortListCommand" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
"taskt.Core.Automation.Commands.ReverseListCommand" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
"taskt.Core.Automation.Commands.CopyListCommand" -> "taskt.Core.Automation.Commands.AListCreateFromListCommands";
}
